Catalogs/СчетаДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СчетаДоверительногоУправления</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Числовая часть кода счета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетаДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСчетовДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныйКабинет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециализированныйДепозитарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьКотировок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиКонсолидированныйБухгалтерскийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораПоУправлениюПенсионнымиНакоплениямиИРезервами</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровПоУправлениюПенсионнымиНакоплениямиИРезервами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеИспользованияЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетныеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КодыСчетовДоверительногоУправленияУБрокеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыСчетовДоверительногоУправленияУБрокеров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодFORTS</Name>
					<Comment>Код счета д/у на рынке Forts</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОсновнойБрокер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорБрокерскогоОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КлиентыДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КлиентыДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлиентыДоверительногоУправления</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсполнителиПоДенежнымСредствамБрокерские.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиПоДенежнымСредствамБрокерские</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсполнителиПоЦеннымБумагам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиПоЦеннымБумагам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсполнителиПоДенежнымСредствамСобственные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиПоДенежнымСредствамСобственные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДоговоровДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровДоверительногоУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйИнвестиционныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиАкционерныхИнвестиционныхФондов</Name>
					<Comment>Управление активами АИФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПаевогоИнвестиционногоФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФизическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФОГФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЮридическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеИмуществомСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиНакоплениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиРезервами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеРезервамиСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеСобственнымиСредствамиПенсионныхФондов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЦелевыхКапиталов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСчетовДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСчетовДоверительногоУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стратегия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СчетаДоверительногоУправления/Forms/ИмпортИИС/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ОпределитьКодПортфеля(Организация, Брокер, БрокерскийДоговор, КодИнвестСчета)
	
	// в соответствии с утвержденной схемой взаимодействия с брокером, мы сами нумеруем портфели;
	// портфели нумеруются последовательно в рамках инвест. счета через разделитель "_",
	// например: 2000_1, 2000_2, 2000_3,…
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Брокер = &Брокер
		|				И ДоговорБрокерскогоОбслуживания = &ДоговорБрокерскогоОбслуживания) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|ГДЕ
		|	ПОДСТРОКА(КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код, 1, &ДлинаКодаИнвестСчета) = &КодИнвестСчета";
	
	Запрос.УстановитьПараметр("Организация",                    Организация);
	Запрос.УстановитьПараметр("Брокер",                         Брокер);
	Запрос.УстановитьПараметр("ДоговорБрокерскогоОбслуживания", БрокерскийДоговор);
	Запрос.УстановитьПараметр("КодИнвестСчета",                 КодИнвестСчета + "_");
	Запрос.УстановитьПараметр("ДлинаКодаИнвестСчета",           СтрДлина(КодИнвестСчета) + 1);
	
	КодыПортфелей = Запрос.Выполнить().Выгрузить();
	
	Если КодыПортфелей.Количество() = 0 Тогда
		Возврат КодИнвестСчета + "_1";
	КонецЕсли;
	
	// чтобы сортировка работала корректно, дополним коды портфелей спереди "0" до макс. длины
	МаксДлинаКодаПортфеля = 0;
	
	Для каждого СтрокаКодыПортфелей Из КодыПортфелей Цикл
		// первым проходом выделим коды портфелей и определим макс. длину
		СтрокаКодыПортфелей.Код = Сред(СтрокаКодыПортфелей.Код, Запрос.Параметры.ДлинаКодаИнвестСчета + 1);
		
		Если Макс(МаксДлинаКодаПортфеля) < СтрДлина(СтрокаКодыПортфелей.Код) Тогда
			МаксДлинаКодаПортфеля = СтрДлина(СтрокаКодыПортфелей.Код);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаКодыПортфелей Из КодыПортфелей Цикл
		// вторым проходом дополним коды портфелей лид. нулями, чтобы подготовить к сортировке
		Пока СтрДлина(СтрокаКодыПортфелей.Код) < МаксДлинаКодаПортфеля Цикл
			СтрокаКодыПортфелей.Код = "0" + СтрокаКодыПортфелей.Код;
		КонецЦикла;
	КонецЦикла;
	
	КодыПортфелей.Сортировать("Код УБЫВ");
	
	Возврат КодИнвестСчета + "_" + Строка(Число(КодыПортфелей[0].Код) + 1);
	
КонецФункции // ОпределитьКодПортфеля

&НаСервереБезКонтекста
Функция ПолучитьДействующуюЛицензиюНаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыЛицензийСрезПоследних.Лицензия КАК Лицензия
		|ИЗ
		|	РегистрСведений.СтатусыЛицензий.СрезПоследних(
		|			&Период,
		|			Лицензия.ЮрФизЛицо = &ЮрФизЛицо
		|				И Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами)) КАК СтатусыЛицензийСрезПоследних
		|ГДЕ
		|	СтатусыЛицензийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)";
	
	Запрос.УстановитьПараметр("Период",    ТекущаяДата());
	Запрос.УстановитьПараметр("ЮрФизЛицо", Организация.ЮрФизЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Лицензия;
	КонецЕсли;
	
	Возврат Справочники.Лицензии.ПустаяСсылка();
	
КонецФункции // ПолучитьДействующуюЛицензиюНаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами

&НаСервереБезКонтекста
Функция ПолучитьАгентскийДоговор(НомерДоговора, ДатаЗаключения)
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Договоры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.АгентскийДоговор)
		|	И Договоры.НомерДоговора = &НомерДоговора
		|	И Договоры.ДатаЗаключения = &ДатаЗаключения
		|");
	Запрос.УстановитьПараметр("НомерДоговора", НомерДоговора);
	Запрос.УстановитьПараметр("ДатаЗаключения", ДатаЗаключения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить()[0].Ссылка;	
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиНовуюОшибку(Ошибки, ТекстОшибки)
	// Если ошибку уже выводили, то повторно выводить не будем	
	Если Ошибки.Найти(ТекстОшибки) = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);	
		Ошибки.Добавить(ТекстОшибки);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьИИСНаСервере()
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ИИС.Очистить();
	
	Если ВнешняяСистема = Справочники.ВнешниеСистемы.СайтИИС Тогда
		//ОбновитьИИСМатрих();
		ОбновитьИИССайт();
	ИначеЕсли ВнешняяСистема = Справочники.ВнешниеСистемы.АгентыДУИИС Тогда
		ОбновитьИИСФайл();	
	КонецЕсли;
КонецПроцедуры // ОбновитьИИСНаСервере

&НаСервере
Процедура ОбновитьИИССайт()
	
	ДатаНачалаИмпорта = РаботаСВнешнимиСистемами.ПолучитьДатуНачалаИмпортаССайта();
	СтрокаXML = РаботаСВнешнимиСистемами.ПолучитьДанныеССайта(ДатаНачалаИмпорта);
	
	КоллекцияОбъектов = РаботаСВнешнимиСистемами.ПолучитьКоллекциюОбъектов(СтрокаXML);
	Если КоллекцияОбъектов <> Неопределено Тогда
		
		ВнешняяСистема = Справочники.ВнешниеСистемы.СайтИИС;
		ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.АнкетыФизическихЛиц;

		Для каждого ОбъектXDTO Из КоллекцияОбъектов Цикл
			
			КодВнешнейСистемы = РаботаСВнешнимиСистемами.ПолучитьЗначениеТипа(Тип("Строка"), ОбъектXDTO.order_id);
			Если РаботаСВнешнимиСистемами.НайтиЗначениеПоКодуВнешнейСистемы(ВнешняяСистема, ГруппаОбъектов, КодВнешнейСистемы) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрокаИИС = ЭтаФорма.ИИС.Добавить();
			НоваяСтрокаИИС.Флажок          = Ложь;
			НоваяСтрокаИИС.ФИО             = ТРег(ОбъектXDTO.surname + " " + ОбъектXDTO.forename + ?(ПустаяСтрока(ОбъектXDTO.patronymic), "", " " + ОбъектXDTO.patronymic));
			НоваяСтрокаИИС.ДатаРегистрации = РаботаСВнешнимиСистемами.ПолучитьЗначениеТипа(Тип("Дата"), ОбъектXDTO.datetime);
			НоваяСтрокаИИС.СтратегияИИ     = ОбъектXDTO.strategy;
			НоваяСтрокаИИС.НомерДоговора   = ОбъектXDTO.dealnum;
			НоваяСтрокаИИС.ДатаДоговора    = ОбъектXDTO.dealdate;
			//НоваяСтрокаИИС.КодФизЛица      = СтрокаВнешниеДанные.Person_ID;
			
		КонецЦикла;
		
		АдресXML = ПоместитьВоВременноеХранилище(СтрокаXML, ?(ПустаяСтрока(АдресXML), УникальныйИдентификатор, АдресXML));
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьИИСФайл()
	СтрокаXML = ПолучитьИзВременногоХранилища(АдресXML);
	
	Если ТипЗнч(СтрокаXML) <> Тип("Массив") Тогда
		СтрокиXML = Новый Массив;
		СтрокиXML.Добавить(СтрокаXML);
	Иначе
		СтрокиXML = СтрокаXML;	
	КонецЕсли;
	
	// Выводим анкеты 	
	Ошибки = Новый Массив;	
	Для Каждого СтрокаXML Из СтрокиXML Цикл
		КоллекцияОбъектов = РаботаСВнешнимиСистемами.ПолучитьКоллекциюОбъектов(СтрокаXML, ВнешняяСистема);
		Если КоллекцияОбъектов <> Неопределено Тогда
			Для Каждого ОбъектXDTO Из КоллекцияОбъектов Цикл
				НоваяСтрокаИИС = ИИС.Добавить();
				НоваяСтрокаИИС.Флажок          = Истина;
				НоваяСтрокаИИС.ФИО             = ТРег(РаботаСВнешнимиСистемами.ПолучитьЗначениеТипа(Тип("Строка"), ОбъектXDTO.ФИО));
				НоваяСтрокаИИС.ДатаРегистрации = РаботаСВнешнимиСистемами.ПолучитьЗначениеТипа(Тип("Дата"), ОбъектXDTO.ДатаФормирования);
				НоваяСтрокаИИС.НомерДоговора   = РаботаСВнешнимиСистемами.ПолучитьЗначениеТипа(Тип("Строка"), ОбъектXDTO.НомерДоговораДУИИС);
				
				Если ОбъектXDTO.Свойства().Получить("ЗАЯВЛЕНИЕ_О_ПРИСОЕДИНЕНИИ") <> Неопределено Тогда 
					ЗаявлениеОПрисоединении = ОбъектXDTO.ЗАЯВЛЕНИЕ_О_ПРИСОЕДИНЕНИИ;
					
					НоваяСтрокаИИС.СтратегияИИ	= РаботаСВнешнимиСистемами.ПолучитьЗначениеТипа(Тип("Строка"), ЗаявлениеОПрисоединении.Стратегия);
					НоваяСтрокаИИС.ДатаДоговора	= РаботаСВнешнимиСистемами.ПолучитьЗначениеТипа(Тип("Дата"), ЗаявлениеОПрисоединении.ДатаДоговора);
				КонецЕсли;
				
				ПредставлениеАгентскогоДоговора = "";
				Если ОбъектXDTO.Свойства().Получить("АГЕНТ") <> Неопределено Тогда
					ДанныеАгента = ОбъектXDTO.АГЕНТ;
					
					НомерАгентскогоДоговора			= РаботаСВнешнимиСистемами.ПолучитьЗначениеТипа(Тип("Строка"), ДанныеАгента.АгентскийДоговор.Номер);
					ДатаАгентскогоДоговора			= РаботаСВнешнимиСистемами.ПолучитьЗначениеТипа(Тип("Дата"), ДанныеАгента.АгентскийДоговор.Дата);
					ПредставлениеАгентскогоДоговора	= "№" + НомерАгентскогоДоговора + " от " + Формат(ДатаАгентскогоДоговора, "ДФ=dd.MM.yyyy");
					
					НоваяСтрокаИИС.АгентскийДоговор = ПолучитьАгентскийДоговор(НомерАгентскогоДоговора, ДатаАгентскогоДоговора);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(НоваяСтрокаИИС.АгентскийДоговор) Тогда
					НоваяСтрокаИИС.Флажок = Ложь;
					ВывестиНовуюОшибку(Ошибки, "Агентский договор " + ?(ПустаяСтрока(ПредставлениеАгентскогоДоговора), НоваяСтрокаИИС.ФИО, ПредставлениеАгентскогоДоговора) + " не найден.");		
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

&НаСервере
Процедура ИмпортироватьИИСНаСервере()
	
	Если      ВнешняяСистема = Справочники.ВнешниеСистемы.СайтИИС Тогда
		ИмпортироватьИСССайт();
	ИначеЕсли ВнешняяСистема = Справочники.ВнешниеСистемы.АгентыДУИИС Тогда
		ИмпортироватьИССФайл();		
	КонецЕсли;		
	
КонецПроцедуры // ИмпортироватьИИСНаСервере

&НаСервере
Процедура ИмпортироватьИССМатрих()
	
	КодыВыбранныхФизЛиц = Новый Массив;
	КодыВыбранныхСтратегийИИ = Новый Массив;
	
	Для каждого СтрокаИИС Из ЭтаФорма.ИИС Цикл
		Если СтрокаИИС.Флажок Тогда
			КодыВыбранныхФизЛиц.Добавить(СтрокаИИС.КодФизЛица);
			
			Если КодыВыбранныхСтратегийИИ.Найти(СтрокаИИС.СтратегияИИ) = Неопределено Тогда
				КодыВыбранныхСтратегийИИ.Добавить(СтрокаИИС.СтратегияИИ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если КодыВыбранныхФизЛиц.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны ИИС для импорта");
		Возврат;
	КонецЕсли;
	
	// импортируем/обновим
	ИмпортНСИ = Обработки.ИмпортНормативноСправочнойИнформации.Создать();
	ИмпортНСИ.ГруппаПравил                     = "Матрих";
	ИмпортНСИ.ГруппаОбъектов                   = Справочники.ГруппыИмпортируемыхОбъектов.ФизическиеЛица;
	ИмпортНСИ.Организация                      = ЭтаФорма.Организация;
	ИмпортНСИ.Подразделение                    = Справочники.Подразделения.ГруппаКомпаний;
	ИмпортНСИ.Язык                             = Справочники.Языки.Русский;
	ИмпортНСИ.НеСообщатьОСозданииНовыхОбъектов = Истина;
	ИмпортНСИ.НеСообщатьОбОтсутствииИзменений  = Истина;
	
	Для каждого КодФизЛица Из КодыВыбранныхФизЛиц Цикл
		НоваяСтрокаИмпортируемыеОбъекты = ИмпортНСИ.ИмпортируемыеОбъекты.Добавить();
		НоваяСтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме = КодФизЛица;
	КонецЦикла;
	
	ИмпортНСИ.ИмпортироватьДанные();
	
	// получим список клиентов д/у и стратегий ИИС
	КодыФизЛиц = Новый Соответствие;
	КодыСтратегийИИ = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|				И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица)) КАК КодыВоВнешнихСистемахСрезПоследних
		|ГДЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Код В(&КодыФизЛиц)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.СайтИИС)
		|				И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.СтратегииИндивидуальногоИнвестирования)) КАК КодыВоВнешнихСистемахСрезПоследних
		|ГДЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Код В(&КодыСтратегийИИ)";
		
	Запрос.УстановитьПараметр("КодыФизЛиц", КодыВыбранныхФизЛиц);
	Запрос.УстановитьПараметр("КодыСтратегийИИ", КодыВыбранныхСтратегийИИ);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатыЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		КодыФизЛиц.Вставить(Выборка.Код, Выборка.Объект);
	КонецЦикла;
	
	Выборка = РезультатыЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		КодыСтратегийИИ.Вставить(Выборка.Код, Выборка.Объект);
	КонецЦикла;
	
	// запишем счета д/у
	Для каждого СтрокаИИС Из ЭтаФорма.ИИС Цикл
		
		Если Не СтрокаИИС.Флажок Тогда
			Продолжить;
		КонецЕсли;
		
		ЮрФизЛицо = КодыФизЛиц[СтрокаИИС.КодФизЛица];
		Если ЮрФизЛицо = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить физ. лицо '" + СтрокаИИС.ФИО + "' по коду '" + СтрокаИИС.КодФизЛица + "'");
			Продолжить;
		КонецЕсли;
		
		ТекСтратегияИИ = КодыСтратегийИИ[СтрокаИИС.СтратегияИИ];
		Если ТекСтратегияИИ = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить стратегию ИИ '" + СтрокаИИС.СтратегияИИ + "' для клиента '" + СтрокаИИС.ФИО + "'");
			Продолжить;
		КонецЕсли;
		
		ИмпортироватьСчетДУ(СтрокаИИС, ЮрФизЛицо, ТекСтратегияИИ);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИмпортироватьИСССайт()
	
	КодыВыбранныхСтратегийИИ = Новый Массив;
	КодыСтратегийИИ          = Новый Соответствие;
	
	Для каждого СтрокаИИС Из ЭтаФорма.ИИС Цикл
		Если СтрокаИИС.Флажок и КодыВыбранныхСтратегийИИ.Найти(СтрокаИИС.СтратегияИИ) = Неопределено Тогда
			КодыВыбранныхСтратегийИИ.Добавить(СтрокаИИС.СтратегияИИ);
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.СайтИИС)
		|				И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.СтратегииИндивидуальногоИнвестирования)) КАК КодыВоВнешнихСистемахСрезПоследних
		|ГДЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Код В(&КодыСтратегийИИ)";
		
	Запрос.УстановитьПараметр("КодыСтратегийИИ", КодыВыбранныхСтратегийИИ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КодыСтратегийИИ.Вставить(Выборка.Код, Выборка.Объект);
	КонецЦикла;

	СтрокаXML = ПолучитьИзВременногоХранилища(АдресXML);
	
	КоллекцияОбъектов = РаботаСВнешнимиСистемами.ПолучитьКоллекциюОбъектов(СтрокаXML);
	Если КоллекцияОбъектов <> Неопределено Тогда
		
		Для каждого ОбъектXDTO Из КоллекцияОбъектов Цикл
			
			СтрокиИИС = ИИС.НайтиСтроки(Новый Структура("Флажок, НомерДоговора", Истина, ОбъектXDTO.dealnum));
			
			Если СтрокиИИС.Количество() Тогда
				
				СтрокаИИС = СтрокиИИС[0];
				
				ЮрФизЛицо = РаботаСВнешнимиСистемами.ПрочитатьАнкетныеДанные(ОбъектXDTO);
				
				Если ЮрФизЛицо = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить физ. лицо '" + СтрокаИИС.ФИО + "' по коду '" + СтрокаИИС.КодФизЛица + "'");
					Продолжить;
				КонецЕсли;
				
				ТекСтратегияИИ = КодыСтратегийИИ[СтрокаИИС.СтратегияИИ];
				Если ТекСтратегияИИ = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить стратегию ИИ '" + СтрокаИИС.СтратегияИИ + "' для клиента '" + СтрокаИИС.ФИО + "'");
					Продолжить;
				КонецЕсли;
				
				ИмпортироватьСчетДУ(СтрокаИИС, ЮрФизЛицо, ТекСтратегияИИ);
				
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИмпортироватьИССФайл()
	
	КодыВыбранныхСтратегийИИ = Новый Массив;
	КодыСтратегийИИ          = Новый Соответствие;
	
	Для каждого СтрокаИИС Из ЭтаФорма.ИИС Цикл
		Если СтрокаИИС.Флажок и КодыВыбранныхСтратегийИИ.Найти(СтрокаИИС.СтратегияИИ) = Неопределено Тогда
			КодыВыбранныхСтратегийИИ.Добавить(СтрокаИИС.СтратегияИИ);
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.АгентыДУИИС)
		|				И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.СтратегииИндивидуальногоИнвестирования)) КАК КодыВоВнешнихСистемахСрезПоследних
		|ГДЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Код В(&КодыСтратегийИИ)";
		
	Запрос.УстановитьПараметр("КодыСтратегийИИ", КодыВыбранныхСтратегийИИ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КодыСтратегийИИ.Вставить(Выборка.Код, Выборка.Объект);
	КонецЦикла;

	СтрокаXML = ПолучитьИзВременногоХранилища(АдресXML);
	
	Если ТипЗнч(СтрокаXML) <> Тип("Массив") Тогда
		СтрокиXML = Новый Массив;
		СтрокиXML.Добавить(СтрокаXML);
	Иначе
		СтрокиXML = СтрокаXML;	
	КонецЕсли;
	
	// Импортируем анкеты 	
	Для Каждого СтрокаXML Из СтрокиXML Цикл	
		КоллекцияОбъектов = РаботаСВнешнимиСистемами.ПолучитьКоллекциюОбъектов(СтрокаXML, ВнешняяСистема);
		Если КоллекцияОбъектов <> Неопределено Тогда		
			Для Каждого ОбъектXDTO Из КоллекцияОбъектов Цикл			
				СтрокиИИС = ИИС.НайтиСтроки(Новый Структура("Флажок, НомерДоговора", Истина, ОбъектXDTO.НомерДоговораДУИИС));			
				Если СтрокиИИС.Количество() Тогда				
					СтрокаИИС = СтрокиИИС[0];
					
					ЮрФизЛицо = РаботаСВнешнимиСистемами.ПрочитатьАнкетныеДанные(ОбъектXDTO, ВнешняяСистема);				
					Если ЮрФизЛицо = Неопределено Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить физ. лицо '" + СтрокаИИС.ФИО + "' по коду '" + СтрокаИИС.КодФизЛица + "'");
						Продолжить;
					КонецЕсли;
					
					ТекСтратегияИИ = КодыСтратегийИИ[СтрокаИИС.СтратегияИИ];
					Если ТекСтратегияИИ = Неопределено Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить стратегию ИИ '" + СтрокаИИС.СтратегияИИ + "' для клиента '" + СтрокаИИС.ФИО + "'");
						Продолжить;
					КонецЕсли;
					
					ИмпортироватьСчетДУ(СтрокаИИС, ЮрФизЛицо, ТекСтратегияИИ);	
				КонецЕсли;	
			КонецЦикла;				
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ИмпортироватьСчетДУ(СтрокаИИС, ЮрФизЛицо, ТекСтратегияИИ)
	
	НачатьТранзакцию();
	
	// Проверка ранее загруженного ИИС
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.НомерДоговора = &НомерДоговора
		|	И СчетаДоверительногоУправления.Организация = &Организация");
	
	Запрос.УстановитьПараметр("НомерДоговора", СтрокаИИС.НомерДоговора);
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Инвестиционный счет по договору " + СтрокаИИС.НомерДоговора + " загружен ранее. Повторная загрузка не выполняется");
		Возврат;
	КонецЕсли;
	
	СчетДоверительногоУправленияСсылка = Справочники.СчетаДоверительногоУправления.ПолучитьСсылку(Новый УникальныйИдентификатор); 
	
	ДатаДоговора = Дата(СтрЗаменить(СтрокаИИС.ДатаДоговора, "-", ""));
	
	// клиент д/у
	Запись = РегистрыСведений.КлиентыДоверительногоУправления.СоздатьМенеджерЗаписи();
	Запись.Период                       = ДатаДоговора;
	Запись.Организация					= ЭтаФорма.Организация;
	Запись.СчетДоверительногоУправления = СчетДоверительногоУправленияСсылка;
	Запись.Клиент                       = ЮрФизЛицо;
	Запись.Записать();
	
	// счет д/у
	СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.СоздатьЭлемент();
	СчетДоверительногоУправления.УстановитьСсылкуНового(СчетДоверительногоУправленияСсылка);
	СчетДоверительногоУправления.Наименование                        = СтрокаИИС.ФИО;
	СчетДоверительногоУправления.Организация                         = ЭтаФорма.Организация;
	СчетДоверительногоУправления.КодСчета                            = Справочники.СчетаДоверительногоУправления.ОпределитьНовыйКодСчета(ЭтаФорма.Организация, Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет, Неопределено);
	СчетДоверительногоУправления.ВидСчетаДоверительногоУправления    = Перечисления.ВидыСчетовДоверительногоУправления.Договор;
	СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет;
	СчетДоверительногоУправления.НомерДоговора                       = СтрокаИИС.НомерДоговора;
	СчетДоверительногоУправления.ДатаЗаключения                      = ДатаДоговора;
	СчетДоверительногоУправления.ДатаРасторжения                     = ДобавитьМесяц(ДатаДоговора, 3*12);
	СчетДоверительногоУправления.АгентскийДоговор					 = СтрокаИИС.АгентскийДоговор;	
	СчетДоверительногоУправления.Записать();
	
	// стратегия ИИ
	Запись = РегистрыСведений.СтратегииИндивидуальногоИнвестирования.СоздатьМенеджерЗаписи();
	Запись.Период                       = ДатаДоговора;
	Запись.Организация                  = ЭтаФорма.Организация;
	Запись.СчетДоверительногоУправления = СчетДоверительногоУправленияСсылка;
	Запись.Стратегия                    = ТекСтратегияИИ;
	Запись.Записать();
	
	// коды счетов д/у у брокера
	Если ЭтаФорма.ЗарегистрироватьКодУОсновногоБрокера Тогда
		
		Запись = РегистрыСведений.КодыСчетовДоверительногоУправленияУБрокеров.СоздатьМенеджерЗаписи();
		Запись.Период                         = ДатаДоговора;
		Запись.Организация                    = ЭтаФорма.Организация;
		Запись.СчетДоверительногоУправления   = СчетДоверительногоУправленияСсылка;
		Запись.Брокер                         = ТекСтратегияИИ.ОсновнойБрокер;
		Запись.ОсновнойБрокер                 = Истина;
		Запись.ДоговорБрокерскогоОбслуживания = ТекСтратегияИИ.ОсновнойБрокерскийДоговор;
		Запись.Код                            = ОпределитьКодПортфеля(ЭтаФорма.Организация, ТекСтратегияИИ.ОсновнойБрокер, ТекСтратегияИИ.ОсновнойБрокерскийДоговор, ТекСтратегияИИ.ОсновнойКодУБрокера);
		Запись.Записать();
		
		// исполнители по д/с брок.
		Для каждого СтрокаОсновныеРасчетныеСчетаБрокера Из ТекСтратегияИИ.ОсновныеРасчетныеСчетаБрокера Цикл
			Запись = РегистрыСведений.ИсполнителиПоДенежнымСредствамБрокерские.СоздатьМенеджерЗаписи();
			Запись.Период                       = ДатаДоговора;
			Запись.Организация                  = ЭтаФорма.Организация;
			Запись.СчетДоверительногоУправления = СчетДоверительногоУправленияСсылка;
			Запись.Брокер                       = ТекСтратегияИИ.ОсновнойБрокер;
			Запись.РасчетныйСчет                = СтрокаОсновныеРасчетныеСчетаБрокера.РасчетныйСчет;
			Запись.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	// исполнители по ц/б
	Для каждого СтрокаОсновныеДепозитарныеСчета Из ТекСтратегияИИ.ОсновныеДепозитарныеСчета Цикл
		Запись = РегистрыСведений.ИсполнителиПоЦеннымБумагам.СоздатьМенеджерЗаписи();
		Запись.Период                       = ДатаДоговора;
		Запись.Организация                  = ЭтаФорма.Организация;
		Запись.СчетДоверительногоУправления = СчетДоверительногоУправленияСсылка;
		Запись.ДепозитарныйСчет             = СтрокаОсновныеДепозитарныеСчета.ДепозитарныйСчет;
		Запись.Записать();
	КонецЦикла;
	
	// исполнители по д/с соб.
	Для каждого СтрокаОсновныеРасчетныеСчета Из ТекСтратегияИИ.ОсновныеРасчетныеСчета Цикл
		Запись = РегистрыСведений.ИсполнителиПоДенежнымСредствамСобственные.СоздатьМенеджерЗаписи();
		Запись.Период                       = ДатаДоговора;
		Запись.Организация                  = ЭтаФорма.Организация;
		Запись.СчетДоверительногоУправления = СчетДоверительногоУправленияСсылка;
		Запись.РасчетныйСчет                = СтрокаОсновныеРасчетныеСчета.РасчетныйСчет;
		Запись.Записать();
	КонецЦикла;
	
	Справочники.СчетаДоверительногоУправления.ЗаполнитьСопутствующиеНастройкиНовогоСчета(СчетДоверительногоУправленияСсылка);
	
	ЗафиксироватьТранзакцию();
	
	// Уведомляем об успехе
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Инвестиционный счет по договору " + СтрокаИИС.НомерДоговора + " успешно загружен", СчетДоверительногоУправленияСсылка);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостоянияФлажков(Флажок)
	
	Для каждого СтрокаИИС Из ЭтаФорма.ИИС Цикл
		СтрокаИИС.Флажок = Флажок;
	КонецЦикла;
	
КонецПроцедуры // ИзменитьСостоянияФлажков

&НаКлиенте
Процедура ОбработатьФайлАнкеты()
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.Фильтр             = НСтр("ru = 'Файл импорта (*.xml)|*.xml'");
		ДиалогОткрытияФайла.ИндексФильтра      = 0;
		ДиалогОткрытияФайла.МножественныйВыбор = Истина;
		ДиалогОткрытияФайла.Заголовок          = НСтр("ru = 'Выберите файлы с выгрузкой ИИС'");
		
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			СтрокиXML = Новый Массив;
			
			Для Каждого ПолноеИмяФайла Из ДиалогОткрытияФайла.ВыбранныеФайлы Цикл 
				ФайлXML = Новый ТекстовыйДокумент;
				ФайлXML.Прочитать(ПолноеИмяФайла, КодировкаТекста.ANSI);
				
				СтрокиXML.Добавить(ФайлXML.ПолучитьТекст());
			КонецЦикла;				
				
			АдресXML = ПоместитьВоВременноеХранилище(СтрокиXML, ?(ПустаяСтрока(АдресXML), УникальныйИдентификатор, АдресXML));
			
			ОбновитьИИСНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИИС()
	Если ВнешняяСистема = ПредопределенноеЗначение("Справочник.ВнешниеСистемы.СайтИИС") Тогда	
		ОбновитьИИСНаСервере();
	ИначеЕсли ВнешняяСистема = ПредопределенноеЗначение("Справочник.ВнешниеСистемы.АгентыДУИИС") Тогда
		ОбработатьФайлАнкеты();	
	КонецЕсли;		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация							= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.ЛицензияНаОсуществлениеДеятельности	= ПолучитьДействующуюЛицензиюНаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами(ЭтаФорма.Организация);
	ЭтаФорма.ВнешняяСистема							= Справочники.ВнешниеСистемы.АгентыДУИИС;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортировать(Команда)
	
	ИмпортироватьИИСНаСервере();
	
	ОбновитьИИСНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	Если Команда.Имя = "КомандаОбновитьССайта" Тогда	
		ВнешняяСистема = ПредопределенноеЗначение("Справочник.ВнешниеСистемы.СайтИИС");
	ИначеЕсли Команда.Имя = "КомандаОбновитьИзФайла" Тогда
		ВнешняяСистема = ПредопределенноеЗначение("Справочник.ВнешниеСистемы.АгентыДУИИС");
	КонецЕсли;		
	
	ОбновитьИИС();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВсеФлажки(Команда)
	
	ИзменитьСостоянияФлажков(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьВсеФлажки(Команда)
	
	ИзменитьСостоянияФлажков(Истина);
	
КонецПроцедуры
